In [1]:
import pandas
pandas.__version__

'1.2.4'

In [2]:
#introducing pandas objects
import numpy as np
import pandas as pd

In [3]:
# series
counts = pd.Series([234,3456,123,765])
counts

0     234
1    3456
2     123
3     765
dtype: int64

In [4]:
counts.values

array([ 234, 3456,  123,  765], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
bacteria = pd.Series([234,3456,123,765],
                    index=['Firmicutes','Proteobacteria','Actinobacteria','Bacteroides'])
bacteria

Firmicutes         234
Proteobacteria    3456
Actinobacteria     123
Bacteroides        765
dtype: int64

In [7]:
bacteria['Actinobacteria']

123

In [8]:
bacteria[0]

234

In [9]:
bacteria.name = 'counts'
bacteria.index.name = 'phylum'
bacteria

phylum
Firmicutes         234
Proteobacteria    3456
Actinobacteria     123
Bacteroides        765
Name: counts, dtype: int64

In [10]:
np.log(bacteria)

phylum
Firmicutes        5.455321
Proteobacteria    8.147867
Actinobacteria    4.812184
Bacteroides       6.639876
Name: counts, dtype: float64

In [11]:
bacteria[bacteria>500]

phylum
Proteobacteria    3456
Bacteroides        765
Name: counts, dtype: int64

In [12]:
bacteria_dict = {'Firmicutes':123,'Proteobacteria':234,'Actinobacteria':1234,'Bacteroidetes':345}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Firmicutes': 123, 'Proteobacteria': 234, 'Actinobacteria': 1234, 'Bacteroidetes': 345}

Firmicutes         123
Proteobacteria     234
Actinobacteria    1234
Bacteroidetes      345
dtype: int64

In [141]:
#DATA FRAME
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013,2042,2013,2014,2014],
        "Literacy":[0.2,0.1,0.5,0.2,0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2042, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.2, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2042       0.1
2       NH  2013       0.5
3       NH  2014       0.2
4       ZH  2014       0.5

In [142]:
df = pd.DataFrame(data,columns=["Year","Province","Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2042       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.2
4  2014       ZH       0.5

In [143]:
df['nonsence']= df.Year / df.Literacy
df

   Year Province  Literacy  nonsence
0  2013       FL       0.2   10065.0
1  2042       FL       0.1   20420.0
2  2013       NH       0.5    4026.0
3  2014       NH       0.2   10070.0
4  2014       ZH       0.5    4028.0

In [144]:
df['Serie_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   Year Province  Literacy  nonsence  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2042       FL       0.1   20420.0              1
2  2013       NH       0.5    4026.0              2
3  2014       NH       0.2   10070.0              3
4  2014       ZH       0.5    4028.0              4

In [145]:
df.to_dict()

{'Year': {0: 2013, 1: 2042, 2: 2013, 3: 2014, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.2, 4: 0.5},
 'nonsence': {0: 10065.0, 1: 20420.0, 2: 4026.0, 3: 10070.0, 4: 4028.0},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [121]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy  nonsence  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2042       FL       0.1   20420.0              1
2  2013       NH       0.5    4026.0              2
3  2014       NH       0.2   10070.0              3
4  2014       ZH       0.5    4028.0              4

In [122]:
# Dataframe as speciallized dictionary
data =[{'a':i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [146]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [124]:
pd.DataFrame(np.random.randint(2,12),
            columns=['foo','bar'],
            index=['a','b','c'])

   foo  bar
a    3    3
b    3    3
c    3    3

In [125]:
ind =pd.Index([12,23,45,54,1,5])
ind

Int64Index([12, 23, 45, 54, 1, 5], dtype='int64')

In [126]:
ind[1]

23

In [127]:
ind[1:5:2]

Int64Index([23, 54], dtype='int64')

In [128]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

6 (6,) 1 int64

In [129]:
ind[2]=0

TypeError: Index does not support mutable operations

In [130]:
rng = np.random.RandomState(10)
ser = pd.Series(rng.randint(1,8,5))
ser

0    2
1    6
2    5
3    1
4    2
dtype: int32

In [131]:
dfr = pd.DataFrame(rng.randint(0,15,(3,4)),
                  columns=['A','B','C','D'])
dfr

    A   B  C   D
0  11  12  9  13
1   0  13  1  10
2   8   9  0  10

In [132]:
np.exp(ser)

0      7.389056
1    403.428793
2    148.413159
3      2.718282
4      7.389056
dtype: float64

In [133]:
np.sin(dfr*np.pi/4)

              A             B         C         D
0  7.071068e-01  3.673940e-16  0.707107 -0.707107
1  0.000000e+00 -7.071068e-01  0.707107  1.000000
2 -2.449294e-16  7.071068e-01  0.000000  1.000000

In [134]:
area = pd.Series({'Alaska':1239864,'Texas':5467387,'California':3456723},name='area')
population = pd.Series({'California':15364728,'Texas':23456123,'New Yark':23457321},name='population')
print(area)
population

Alaska        1239864
Texas         5467387
California    3456723
Name: area, dtype: int64

California    15364728
Texas         23456123
New Yark      23457321
Name: population, dtype: int64

In [135]:
population/area

Alaska             NaN
California    4.444883
New Yark           NaN
Texas         4.290189
dtype: float64

In [136]:
area.index|population.index

<ipython-input-136-b132a20899a3>:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  area.index|population.index

Index(['Alaska', 'California', 'New Yark', 'Texas'], dtype='object')

In [137]:
A = pd.Series([1,3,6],index=[0,1,2])
B = pd.Series([1,3,2],index=[1,2,3])
print(A)
print(B)
B
A+B

0    1
1    3
2    6
dtype: int64
1    1
2    3
3    2
dtype: int64

0    NaN
1    4.0
2    9.0
3    NaN
dtype: float64

In [138]:
A.add(B,fill_value=0)

0    1.0
1    4.0
2    9.0
3    2.0
dtype: float64

In [148]:
df

   Year Province  Literacy  nonsence  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2042       FL       0.1   20420.0              1
2  2013       NH       0.5    4026.0              2
3  2014       NH       0.2   10070.0              3
4  2014       ZH       0.5    4028.0              4

In [149]:
df2 = pd.DataFrame({"Province": ["FL","NH","ZH"],"population":["100000","200000","300000"]})
df2

  Province population
0       FL     100000
1       NH     200000
2       ZH     300000

In [150]:
df.merge(df2)

   Year Province  Literacy  nonsence  Serie_aligned population
0  2013       FL       0.2   10065.0              0     100000
1  2042       FL       0.1   20420.0              1     100000
2  2013       NH       0.5    4026.0              2     200000
3  2014       NH       0.2   10070.0              3     200000
4  2014       ZH       0.5    4028.0              4     300000

In [152]:
df3= pd.DataFrame({"province":["FL","NH"],"Population":["100000","200000"]})
df3
df.merge(df3,right_on='province',left_on='Province')

   Year Province  Literacy  nonsence  Serie_aligned province Population
0  2013       FL       0.2   10065.0              0       FL     100000
1  2042       FL       0.1   20420.0              1       FL     100000
2  2013       NH       0.5    4026.0              2       NH     200000
3  2014       NH       0.2   10070.0              3       NH     200000

In [157]:
df4 = pd.DataFrame({"Province":["FL","NH","UT"],"Population":["200000","100000","3000"]})
df.merge(df4,how='outer')

     Year Province  Literacy  nonsence  Serie_aligned Population
0  2013.0       FL       0.2   10065.0            0.0     200000
1  2042.0       FL       0.1   20420.0            1.0     200000
2  2013.0       NH       0.5    4026.0            2.0     100000
3  2014.0       NH       0.2   10070.0            3.0     100000
4  2014.0       ZH       0.5    4028.0            4.0        NaN
5     NaN       UT       NaN       NaN            NaN       3000

In [158]:
df5 = pd.DataFrame({"Province":["FL","NH","FL"],"Population":["200000","100000","30000"]})
print(df)
df.merge(df5,how='outer')

   Year Province  Literacy  nonsence  Serie_aligned
0  2013       FL       0.2   10065.0              0
1  2042       FL       0.1   20420.0              1
2  2013       NH       0.5    4026.0              2
3  2014       NH       0.2   10070.0              3
4  2014       ZH       0.5    4028.0              4

   Year Province  Literacy  nonsence  Serie_aligned Population
0  2013       FL       0.2   10065.0              0     200000
1  2013       FL       0.2   10065.0              0      30000
2  2042       FL       0.1   20420.0              1     200000
3  2042       FL       0.1   20420.0              1      30000
4  2013       NH       0.5    4026.0              2     100000
5  2014       NH       0.2   10070.0              3     100000
6  2014       ZH       0.5    4028.0              4        NaN

In [162]:
serie_a = pd.Series([np.nan,1.5,np.nan,2.5,3.5,np.nan],
                    index=['f','e','d','c','b','a'])
serie_b = pd.Series(np.arange(len(serie_a),dtype=np.float64),
                    index=['f','e','d','c','b','a'])

In [164]:
serie_a

f    NaN
e    1.5
d    NaN
c    2.5
b    3.5
a    NaN
dtype: float64

In [165]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [166]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),index=serie_a.index)

f    0.0
e    1.5
d    2.0
c    2.5
b    3.5
a    5.0
dtype: float64

In [167]:
serie_a.combine_first(serie_b)

f    0.0
e    1.5
d    2.0
c    2.5
b    3.5
a    5.0
dtype: float64